## Hierarchical Indexing

In [5]:
import pandas as pd
import numpy as np

In [6]:
data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                       [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [7]:
data

a  1    0.817844
   2    1.942936
   3   -1.181219
b  1    0.900292
   3    0.302335
c  1    1.764121
   2    0.843503
d  2    0.430421
   3    0.130012
dtype: float64

In [11]:
data["a":"c"] #slice

a  1    0.817844
   2    1.942936
   3   -1.181219
b  1    0.900292
   3    0.302335
c  1    1.764121
   2    0.843503
dtype: float64

In [10]:
data.loc[["a","c"]]

a  1    0.817844
   2    1.942936
   3   -1.181219
c  1    1.764121
   2    0.843503
dtype: float64

In [12]:
data.unstack() ## to convert in normal 2d data frame

          1         2         3
a  0.817844  1.942936 -1.181219
b  0.900292       NaN  0.302335
c  1.764121  0.843503       NaN
d       NaN  0.430421  0.130012

In [13]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])

In [14]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [51]:
df = pd.DataFrame(
    [['Inam',"lahore"],
    ['Ali','Karachi']]
, columns=[['PIAIC','PIAIC'],['Name','City']])

In [52]:
df

  PIAIC
   Name     City
0  Inam   lahore
1   Ali  Karachi

In [26]:
df = pd.DataFrame(
    [['3553',"91"],
    ["225","93"],["225","93"]]

, columns=[['PIAIC','PIAIC'],['Name','City']])

In [27]:
df

  PIAIC
   Name City
0  3553   91
1   225   93
2   225   93

In [53]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [54]:
frame.sort_index()

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [58]:
frame.sort_index(level=1) #it will sort "key 2" its in level 1

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [86]:
student = pd.read_excel('student.xlsx',sheet_name=0)
studentContact = pd.read_excel('student.xlsx',sheet_name=1)

In [87]:
student

    Name  Class  Roll No
0  ghjag     Ai     5553
1   jlkj     Ai     8898
2    sdf     Ai     6534
3  dsggs     Ai     4789
4     fd     Ai     8794

In [88]:
studentContact

   Roll No  Contact
0     5553   789562
1     8898   368623
2     6534   495623
3     8794    56465
4     6534   898989
5     8794   896244
6     5655    89656

In [89]:
#inner to take common , outer to take all values, left  see from left side will neglate if therei is extar on right one,
#right is opposite to left
sss = pd.merge(student,studentContact ,on="Roll No",how = "inner")
sss

    Name  Class  Roll No  Contact
0  ghjag     Ai     5553   789562
1   jlkj     Ai     8898   368623
2    sdf     Ai     6534   495623
3    sdf     Ai     6534   898989
4     fd     Ai     8794    56465
5     fd     Ai     8794   896244